; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image5 - mode
	image2 - mode
	spectrograph1 - mode
	thermograph3 - mode
	infrared0 - mode
	image7 - mode
	thermograph6 - mode
	thermograph4 - mode
	image8 - mode
	Star0 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image8)
	(supports instrument0 image7)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 image5)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph6)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 image7)
	(have_image Planet7 spectrograph1)
	(have_image Planet7 thermograph6)
	(have_image Star8 spectrograph1)
	(have_image Star8 image7)
	(have_image Star8 thermograph6)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon9 thermograph3)
	(have_image Planet10 spectrograph1)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon11 image8)
	(have_image Phenomenon11 thermograph4)
	(have_image Planet12 thermograph4)
))

)

; plan
1. (turn_to satellite1 groundstation4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 14
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 0 of 14
5. (take_image satellite1 star8 instrument2 thermograph6)
   added: (have_image star8 thermograph6)
   goals met: 1 of 14
6. (turn_to satellite1 planet7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet7)
   goals met: 1 of 14
7. (turn_to satellite0 star2 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star2)
   goals met: 1 of 14
8. (take_image satellite1 planet7 instrument2 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 2 of 14
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 14
10. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 14
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 14
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 14
13. (turn_to satellite0 phenomenon11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 14
14. (take_image satellite0 phenomenon11 instrument0 image8)
   added: (have_image phenomenon11 image8)
   goals met: 3 of 14
15. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 14
16. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 4 of 14
17. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 14
18. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 5 of 14
19. (take_image satellite0 phenomenon9 instrument0 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 6 of 14
20. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 6 of 14
21. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 7 of 14
22. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 7 of 14
23. (take_image satellite0 planet7 instrument0 image7)
   added: (have_image planet7 image7)
   goals met: 8 of 14
24. (take_image satellite0 planet7 instrument0 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 9 of 14
25. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 9 of 14
26. (take_image satellite0 star8 instrument0 image7)
   added: (have_image star8 image7)
   goals met: 10 of 14
27. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 11 of 14
28. (turn_to satellite1 groundstation1 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation1)
   goals met: 11 of 14
29. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 11 of 14
30. (turn_to satellite1 phenomenon11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon11)
   goals met: 11 of 14
31. (take_image satellite1 phenomenon11 instrument1 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 12 of 14
32. (take_image satellite1 phenomenon11 instrument1 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 13 of 14
33. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 13 of 14
34. (take_image satellite1 planet12 instrument1 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 14 of 14
